InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КурсВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НазваниеВалюты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦифровойКодВалюты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СимвольныйКодВалюты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/СерверныеПроцедуры/Ext/Module.bsl
Процедура АвтоСумма(СтрокаТабличнойЧасти) Экспорт 
	 СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
 КонецПроцедуры


&НаСервере
Функция ПолучитьСведенияОВалюте(СимвольныйКодВалюты) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.КурсВалюты КАК КурсВалюты,
		|	КурсыВалютСрезПоследних.Номинал КАК Номинал
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
		|ГДЕ
		|	КурсыВалютСрезПоследних.СимвольныйКодВалюты = &СимвольныйКодВалюты"; 
	
	Запрос.УстановитьПараметр("СимвольныйКодВалюты", СимвольныйКодВалюты);
	
	Результат = Запрос.Выполнить().Выгрузить(); 
	Возврат Результат;
КонецФункции 

&НаСервере
Процедура СохранитьЗначенияРеквизитов(КлючУникальности, СписокНастроек) Экспорт
	ХранилищеОбщихНастроек.Сохранить(КлючУникальности,,СписокНастроек)
КонецПроцедуры 

&НаСервере
Функция ВосстановитьЗначенияРеквизитов(КлючУникальности) Экспорт 
	ЗначенияРеквизитов = ХранилищеОбщихНастроек.Загрузить(КлючУникальности);
	ХранилищеОбщихНастроек.Удалить(КлючУникальности, Неопределено, Неопределено);
	Возврат ЗначенияРеквизитов;
КонецФункции
